const roles = {
    '🏝️  𝗡𝗼𝘃𝗮𝘁𝗼 𝗹 ⚜️': 5
    '🏝️  𝗡𝗼𝘃𝗮𝘁𝗼 𝗹𝗹 ⚜️': 7
    '🏝️  𝗡𝗼𝘃𝗮𝘁𝗼 𝗹𝗹𝗹 ⚜️': 9
    '🏝️  𝗡𝗼𝘃𝗮𝘁𝗼 𝗹𝗩 ⚜️': 12
    '🏝️  𝗡𝗼𝘃𝗮𝘁𝗼 𝗩 ⚜️': 15
    '🏟️  𝗔𝗽𝗿𝗲𝗻𝗱𝗶𝘇 𝗹 🥃': 20
    '🏟️  𝗔𝗽𝗿𝗲𝗻𝗱𝗶𝘇 𝗹𝗹 🥃': 23
    '🏟️  𝗔𝗽𝗿𝗲𝗻𝗱𝗶𝘇 𝗹𝗹𝗹 🥃': 26
    '🏟️  𝗔𝗽𝗿𝗲𝗻𝗱𝗶𝘇 𝗹𝗩 🥃': 29
    '🏟️  𝗔𝗽𝗿𝗲𝗻𝗱𝗶𝘇 𝗩 🥃': 31
    '🎋 𝗔𝘃𝗲𝗻𝘁𝘂𝗿𝗲𝗿𝗼 𝗹 🎍': 35
    '🎋 𝗔𝘃𝗲𝗻𝘁𝘂𝗿𝗲𝗿𝗼 𝗹𝗹 🎍': 38
    '🎋 𝗔𝘃𝗲𝗻𝘁𝘂𝗿𝗲𝗿𝗼 𝗹𝗹𝗹 🎍': 40
    '🎋 𝗔𝘃𝗲𝗻𝘁𝘂𝗿𝗲𝗿𝗼 𝗹𝗩 🎍': 45
    '🎋 𝗔𝘃𝗲𝗻𝘁𝘂𝗿𝗲𝗿𝗼 𝗩 🎍': 50
    '⚠️ 𝗦𝗵𝗮𝗱𝗼𝘄 𝗹 🧫': 60
    '⚠️ 𝗦𝗵𝗮𝗱𝗼𝘄 𝗹𝗹 🧫': 70
    '⚠️ 𝗦𝗵𝗮𝗱𝗼𝘄 𝗹𝗹𝗹 🧫': 80
    '⚠️ 𝗦𝗵𝗮𝗱𝗼𝘄 𝗹𝗩 🧫': 90
    '⚠️ 𝗦𝗵𝗮𝗱𝗼𝘄 𝗩 🧫': 100
    '🔮 𝗧𝗵𝗲 𝗚𝗼𝗱 𝗹 🔰': 150
    '🔮 𝗧𝗵𝗲 𝗚𝗼𝗱 𝗹𝗹 🔰': 200
    '🔮 𝗧𝗵𝗲 𝗚𝗼𝗱 𝗹𝗹𝗹 🔰': 300
    '🔮 𝗧𝗵𝗲 𝗚𝗼𝗱 𝗹𝗩 🔰': 600
    '🔮 𝗧𝗵𝗲 𝗚𝗼𝗱 𝗩 🔰': 1200
    '🔱 𝗧𝗵𝗲 𝗚𝗼𝗱 𝗼𝗳 𝗘𝘃𝗲𝗿𝘆𝘁𝗵𝗶𝗻𝗴 🧬': 2000
    '🏞️ 𝗧𝗵𝗲 𝗚𝗼𝗱 𝗼𝗳 𝗦𝗵𝗮𝗱𝗼𝘄 ⚫': 3000
    '🌴 𝗧𝗵𝗲 𝗗𝗲𝘀𝘁𝗿𝗼𝘆𝗲𝗿 𝗼𝗳 𝘂𝗻𝗶𝘃𝗲𝗿𝘀𝗲𝘀 🌌': 4000
    '🌌 𝗖𝗿𝗲𝗮𝘁𝗼𝗿 𝗼𝗳 𝗦𝗵𝗮𝗱𝗼𝘄 📡': 10000
}

export function before(m) {
        let user = db.data.users[m.sender]
        let level = user.level
        let role = (Object.entries(roles).sort((a, b) => b[1] - a[1]).find(([, minLevel]) => level >= minLevel) || Object.entries(roles)[0])[0]
        user.role = role
        return !0
    
}

    //'👑 *∞ ÉLITE GLOBAL I* 💎🏁': 300